In [ ]:
#pip install mysql.connector.python
#pip install pandas sqlalchemy mysql-connector-python

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import mysql.connector
from sqlalchemy import create_engine, types

#to ignore warnings
import warnings
warnings.filterwarnings('ignore')

In [2]:
Conn = mysql.connector.connect(
  host="localhost",               #hostname
  user="root",                   # the user who has privilege to the db
  passwd="Sameer@786",               #password for user
  database="eda_practice",               #database name
)

In [3]:
query = "select * from cars;"

In [4]:
df = pd.read_sql(query,Conn)
df.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,None,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,None,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,None,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,None,17.74

### **Car Dataset**

In [11]:
# Load the dataset
df = pd.read_csv(r'D:\Python\Explorator Data Analysis\Car\Car\Car.csv')
df.dtypes

S.No.                  int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
New_Price             object
Price                float64
dtype: object

In [13]:
# Load the dataset
df = pd.read_csv(r'D:\Python\Explorator Data Analysis\Car\Car\Car.csv')

# Define MySQL connection string
engine = create_engine('mysql+mysqlconnector://root:Sameer%40786@localhost/eda_practice')

# Define data types for MySQL table
dtype_mapping = {
    'S.No.': types.Integer(),
    'Name': types.String(255),
    'Location': types.String(255),
    'Year': types.Integer(),
    'Kilometers_Driven': types.Integer(),
    'Fuel_Type': types.String(50),
    'Transmission': types.String(50),
    'Owner_Type': types.String(50),
    'Mileage': types.String(50),
    'Engine': types.String(50),
    'Power': types.String(50),
    'Seats': types.Float(),
    'New_Price': types.String(255),  # Adjust length based on your data
    'Price': types.Float()
}

# Write the DataFrame to the MySQL table, handling null values
df.to_sql(name='cars', con=engine, if_exists='replace', index=False, dtype=dtype_mapping)

print("Data loaded successfully.")

Data loaded successfully.

### **Global Super Store Dataset**

In [28]:
# Load the dataset
df = pd.read_csv(r'D:\Python\EDA\Global_Store\Global_SuperStore_16.csv', parse_dates=['Order Date', 'Ship Date'])

df.drop('Unnamed: 0', axis=1, inplace=True)

# Define MySQL connection string
engine = create_engine('mysql+mysqlconnector://root:Sameer%40786@localhost/eda_practice')

# Define data types for MySQL table
dtype_mapping = {
    'Row ID': types.Integer(),
    'Order ID': types.String(50),
    'Order Date': types.DateTime(),
    'Ship Date': types.DateTime(),
    'Ship Mode': types.String(50),
    'Customer ID': types.String(50),
    'Customer Name': types.String(100),
    'Segment': types.String(50),
    'Postal Code': types.Float(),  # Consider checking and handling missing values for postal codes
    'City': types.String(100),
    'State': types.String(50),
    'Country': types.String(50),
    'Region': types.String(50),
    'Market': types.String(50),
    'Product ID': types.String(50),
    'Category': types.String(50),
    'Sub-Category': types.String(50),
    'Product Name': types.String(255),
    'Sales': types.Float(),
    'Quantity': types.Integer(),
    'Discount': types.Float(),
    'Profit': types.Float(),
    'Shipping Cost': types.Float(),
    'Order Priority': types.String(50),
    'Returned': types.String(50)  # Adjust length if needed
}

# Write the DataFrame to the MySQL table, handling null values
df.to_sql(name='global_superstore', con=engine, if_exists='replace', index=False, dtype=dtype_mapping)

print("Data loaded successfully.")

Data loaded successfully.

In [35]:
mydb = mysql.connector.connect(
  host="localhost",               #hostname
  user="root",                   # the user who has privilege to the db
  passwd="Sameer@786",               #password for user
  database="eda_practice",               #database name
)

In [6]:
query = "select * from euromart_stores;"

In [7]:
b = pd.read_sql(query,Conn)
b.head(2)

,Order ID,Order Date,Customer Name,Country,State,City,Region,Segment,Ship Mode,Category,Sub-Category,Product Name,Discount,Sales,Profit,Quantity,Feedback?
0,BN-2011-7407039,2011-01-01,Ruby Patel,Sweden,Stockholm,Stockholm,North,Home Office,Economy Plus,Office Supplies,Paper,"Enermax Note Cards, Premium",0.5,45,-26,3,False
1,AZ-2011-9050313,2011-01-03,Summer Hayward,United Kingdom,England,Southport,North,Consumer,Economy,Furniture,Bookcases,"Dania Corner Shelving, Traditional",0.0,854,290,7,True

In [33]:
#mydb.close()